---
kind: property
id: P:Autodesk.Revit.UI.UIControlledApplication.ControlledApplication
source: html/85b944dc-45d9-e99e-392b-1c720042cd78.htm
---
# Autodesk.Revit.UI.UIControlledApplication.ControlledApplication Property

Returns the database level ControlledApplication represented by this UI-level ControlledApplication.

## Syntax (C#)
```csharp
public ControlledApplication ControlledApplication { get; }
```